tutorials/Wedge-HeatExchange-5ms-use1Dcode/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 1;

vertices
(
    (0 0 -0.005)  //0
    (0.5 0 -0.005) //1
    (0.5 0.01265 -0.005) //2
    (0 0.01265 -0.005) //3
    (0 0 0.005) //4
    (0.5 0 0.005) //5
    (0.5 0.01265 0.005) //6
    (0 0.01265 0.005) //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 6 1) simpleGrading (1 .10  1)
);

edges
(
);

boundary
(
    exteriorWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    inlet
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
        (0 3 2 1)
        (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
