tutorials/Wedge-HeatExchange-5ms-use1Dcode/0/pointPriority
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       labelList;
    location    "0";
    object      pointPriority;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


2613
(
1073893736
-1007885627
1062590567
869649207
-1147604403
1128914766
1073894977
-1007885660
1062590567
-1991596188
-1147604404
334810087
1073896218
-1007885674
1062590567
1826152021
1000898693
-460420495
1073897458
-1007885659
1062590567
869648422
-1147604403
-1255651075
1073898699
-1007885658
1062590567
1826152451
1000898693
-2049755756
1073899940
-1007885658
1062590567
-658565599
1001553109
1449980958
1073901181
-1007885643
1062590567
392430289
-1146584954
654750379
1073902422
-1007885675
1062590567
1826152114
1000898693
-139354303
1073903662
-1007885658
1062590567
1348933886
999820990
-934584884
1073904903
-1007885659
1062590567
869648422
-1147604403
-1729815466
1073906144
-1007885644
1062590567
-1991595841
-1147604404
1771047150
1073907385
-1007885659
1062590567
1826152545
1000898693
975816569
1073908626
-1007885691
1062590567
869647637
-1147604403
180585989
1073909867
-1007885643
1062590567
1826152835
1000898693
-613518693
1073911107
-1007885644
1062590567
-1991595841
-1147604404
-1408749275
1073912348
-1007885676
1062590567
477221091
994865607
2090987442
1073913589
-1007885659
...
)


// ************************************************************************* //
